# 序列 (内容链接，有序，支持下表索引的一类数据容器)  切片操作  从一个序列中取出一个子序列
# 语法    序列 [起始下标： 结束下标： 步长]   步长n   登陆每次跳过n-1个元素取值
# 此操作不影响序列本身，而是形成一个新序列

 # ------------------------分割-----------------------------

 # 对列表进行切片
my_list = [0,1,2,3,4,5,6]
resutlt1 = my_list[1:4]
print(f"结果1：{resutlt1}")

resutlt5 = my_list[5:0:-2]
print(f"结果5：{resutlt5}")

 # 对元组进行切片
tuple1 = ()
resutlt2 = tuple1[:]     # 起始和结束不写表示从头到尾，步长为1
print(f"结果2：{resutlt2}")

 # 对字符串进行切片
str1 = "0123456789"
resutlt3 = str1[::2]
print(f"结果3：{resutlt3}")

resutlt4 = str1[::-1]
print(f"结果4：{resutlt4}")


# 作业：
# 字符串：“学python，来黑马程序员，月薪过万”
# 需要得到“员序程马黑”

zuoyestr = "学python，来黑马程序员，月薪过万"
zixulie1 = zuoyestr[13:8:-1]
print(f"作业:{zixulie1}")


# --------------------分割---------------------------
